from random import *

signs = ['овен', 'телец', 'близнецы', 'рак',
         'лев', 'дева', 'весы', 'скорпион',
         'стрелец', 'козерог', 'водолей', 'рыбы', ]

sign = input('Введите свой знак зодиака: ').lower()

if sign not in signs:
    print('Некорректный ввод!')
else:
    match sign:
        case 'овен':
            predict = ['предсказание 1', 'предсказание 2', 'предсказание 3',
                       'предсказание 4', 'предсказание 5', 'предсказание 6',
                       'предсказание 6', 'предсказание 8', 'предсказание 9', ]
            print(f'Ваше предсказание на сегодня: {choice(predict)}')



